Tekla.Structures.Model.Contour.AddContourPoint(Tekla.Structures.Model.ContourPoint)
Adds a new contour point to the contour. Do not add the same contour point twice.
Throws an exception if the point can't be added.
Point: The contour point to add.

Tekla.Structures.Model.Contour.CalculatePolygon(Tekla.Structures.Model.Polygon@)
Calculate a polygon approximating the contour with chamfers evaluated.
Returns: